# ‚¨áÔ∏è Imaport Libraries

In [1]:
import pandas as pd
import numpy as np

# Read üìñ Datasets üóÉÔ∏è & Analysis üîç of JD.com

### Reading JD_order_data.csv üìÅ table from dataset

In [2]:
df_order =  pd.read_csv('JD_order_data.csv')

#### *Simple üïµÔ∏èüïµÔ∏è‚Äç‚ôÄÔ∏è Quality & Descriptive Analysis on the table*

In [3]:
df_order.head()

,order_ID,user_ID,sku_ID,order_date,order_time,quantity,type,promise,original_unit_price,final_unit_price,direct_discount_per_unit,quantity_discount_per_unit,bundle_discount_per_unit,coupon_discount_per_unit,gift_item,dc_ori,dc_des
0,d0cf5cc6db,0abe9ef2ce,581d5b54c1,2018-03-01,2018-03-01 17:14:25.0,1,2,-,89.0,79.0,0.0,10.0,0.0,0.0,0,4,28
1,7444318d01,33a9e56257,067b673f2b,2018-03-01,2018-03-01 11:10:40.0,1,1,2,99.9,53.9,5.0,41.0,0.0,0.0,0,28,28
2,f973b01694,4ea3cf408f,623d0a582a,2018-03-01,2018-03-01 09:13:26.0,1,1,2,78.0,58.5,19.5,0.0,0.0,0.0,0,28,28
3,8c1cec8d4b,b87cb736cb,fc5289b139,2018-03-01,2018-03-01 21:29:50.0,1,1,2,61.0,35.0,0.0,26.0,0.0,0.0,0,4,28
4,d43a33c38a,4829223b6f,623d0a582a,2018-03-01,2018-03-01 19:13:37.0,1,1,1,78.0,53.0,19.0,0.0,0.0,6.0,0,3,16

In [4]:
df_order.dtypes

order_ID                       object
user_ID                        object
sku_ID                         object
order_date                     object
order_time                     object
quantity                        int64
type                            int64
promise                        object
original_unit_price           float64
final_unit_price              float64
direct_discount_per_unit      float64
quantity_discount_per_unit    float64
bundle_discount_per_unit      float64
coupon_discount_per_unit      float64
gift_item                       int64
dc_ori                          int64
dc_des                          int64
dtype: object

In [5]:
df_order.describe()

,quantity,type,original_unit_price,final_unit_price,direct_discount_per_unit,quantity_discount_per_unit,bundle_discount_per_unit,coupon_discount_per_unit,gift_item,dc_ori,dc_des
count,549989.000000,549989.000000,549989.000000,549989.000000,549989.000000,549989.000000,549989.000000,549989.000000,549989.000000,549989.000000,549989.000000
mean,1.216670,1.499139,102.813542,71.572599,19.845889,7.843390,0.625649,2.926015,0.172014,12.062714,21.679845
std,1.844589,0.500000,95.035563,75.879057,33.593536,17.994354,6.442281,11.588338,0.377393,14.201200,16.973899
min,1.000000,1.000000,0.000000,-32.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,1.000000
25%,1.000000,1.000000,59.000000,33.000000,0.000000,0.000000,0.000000,0.000000,0.000000,4.000000,5.000000
50%,1.000000,1.000000,79.000000,58.000000,4.000000,0.000000,0.000000,0.000000,0.000000,7.000000,20.000000
75%,1.000000,2.000000,139.000000,95.000000,21.000000,0.000000,0.000000,0.000000,0.000000,10.000000,34.000000
max,400.000000,2.000000,12158.000000,12158.000000,720.000000,225.000000,252.000000,210.000000,1.000000,67.000000,67.000000

In [6]:
df_order.duplicated().sum()

3928

In [7]:
df_order.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 549989 entries, 0 to 549988
Data columns (total 17 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   order_ID                    549989 non-null  object
 1   user_ID                     549989 non-null  object
 2   sku_ID                      549989 non-null  object
 3   order_date                  549989 non-null  object
 4   order_time                  549989 non-null  object
 5   quantity                    549989 non-null  int64
 6   type                        549989 non-null  int64
 7   promise                     549989 non-null  object
 8   original_unit_price         549989 non-null  float64
 9   final_unit_price            549989 non-null  float64
 10  direct_discount_per_unit    549989 non-null  float64
 11  quantity_discount_per_unit  549989 non-null  float64
 12  bundle_discount_per_unit    549989 non-null  float64
 13  coupon_discount_per_unit    549989 non-null  float64
 14  gift_item                   549989 non-null  int64
 15  dc_ori                      549989 non-null  int64
 16  dc_des                      549989 non-null  int64
dtypes: float64(6), int64(5), object(6)
memory usage: 71.3+ MB

##### üîç Find Inconsistency

In [23]:
df_order['promise']

0         NaN
1           2
2           2
3           2
4           1
         ...
549984    NaN
549985      3
549986      2
549987    NaN
549988      4
Name: promise, Length: 549989, dtype: object

In [8]:
df_order['promise'].isin(['-']).sum()

208583

In [9]:
df_order['promise'].replace('-',np.nan,inplace=True)
print(df_order['promise'].isnull().sum())

208583

### Reading JD_sku_data.csv üìÅ table from dataset

In [10]:
df_sku =  pd.read_csv('JD_sku_data.csv')

#### *Simple üïµÔ∏èüïµÔ∏è‚Äç‚ôÄÔ∏è Quality & Descriptive Analysis on the table*

In [11]:
df_sku.head()

,sku_ID,type,brand_ID,attribute1,attribute2,activate_date,deactivate_date
0,a234e08c57,1,c3ab4bf4d9,3.0,60.0,NaN,NaN
1,6449e1fd87,1,1d8b4b4c63,2.0,50.0,NaN,NaN
2,09b70fcd83,2,eb7d2a675a,3.0,70.0,NaN,NaN
3,acad9fed04,2,9b0d3a5fc6,3.0,70.0,NaN,NaN
4,2fa77e3b4d,2,b681299668,-,-,NaN,NaN

In [12]:
print(df_sku['attribute1'].isin(['-']).sum())
print(df_sku['attribute2'].isin(['-']).sum())

15961
17319

In [13]:
df_sku['attribute1'].replace('-',np.nan,inplace=True)
print(df_sku['attribute1'].isnull().sum())

15961

In [14]:
df_sku['attribute2'].replace('-',np.nan,inplace=True)
print(df_sku['attribute2'].isnull().sum())

17319

In [15]:
df_sku.describe()

               type
count  31868.000000
mean       1.963380
std        0.187829
min        1.000000
25%        2.000000
50%        2.000000
75%        2.000000
max        2.000000

In [16]:
df_sku.duplicated().sum()

0

In [17]:
df_sku.dtypes

sku_ID             object
type                int64
brand_ID           object
attribute1         object
attribute2         object
activate_date      object
deactivate_date    object
dtype: object

In [18]:
df_sku.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31868 entries, 0 to 31867
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   sku_ID           31868 non-null  object
 1   type             31868 non-null  int64
 2   brand_ID         31868 non-null  object
 3   attribute1       15907 non-null  object
 4   attribute2       14549 non-null  object
 5   activate_date    3058 non-null   object
 6   deactivate_date  1141 non-null   object
dtypes: int64(1), object(6)
memory usage: 1.7+ MB

### Reading JD_user_data.csv üìÅ table from dataset

In [19]:
df_user =  pd.read_csv('JD_user_data.csv')

#### *Simple üïµÔ∏èüïµÔ∏è‚Äç‚ôÄÔ∏è Quality & Descriptive Analysis on the table*

In [20]:
df_user.head()

,user_ID,user_level,first_order_month,plus,gender,age,marital_status,education,city_level,purchase_power
0,000089d6a6,1,2017-08,0,F,26-35,S,3,4,3
1,0000babd1f,1,2018-03,0,U,U,U,-1,-1,-1
2,0000bc018b,3,2016-06,0,F,>=56,M,3,2,3
3,0000d0e5ab,3,2014-06,0,M,26-35,M,3,2,2
4,0000dce472,3,2012-08,1,U,U,U,-1,-1,-1

In [21]:
df_user.dtypes

user_ID              object
user_level            int64
first_order_month    object
plus                  int64
gender               object
age                  object
marital_status       object
education             int64
city_level            int64
purchase_power        int64
dtype: object

In [22]:
df_user.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457298 entries, 0 to 457297
Data columns (total 10 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   user_ID            457298 non-null  object
 1   user_level         457298 non-null  int64
 2   first_order_month  457298 non-null  object
 3   plus               457298 non-null  int64
 4   gender             457298 non-null  object
 5   age                457298 non-null  object
 6   marital_status     457298 non-null  object
 7   education          457298 non-null  int64
 8   city_level         457298 non-null  int64
 9   purchase_power     457298 non-null  int64
dtypes: int64(5), object(5)
memory usage: 34.9+ MB

In [133]:
df_user['first_order_month'].sample(20)

229562    2015-11
282581    2017-03
389029    2015-06
276388    2015-05
64324     2018-03
323776    2018-03
184128    2014-05
259874    2016-06
317264    2016-11
353088    2016-08
428722    2010-06
268974    2017-11
301933    2017-10
195853    2017-11
420591    2012-05
287542    2016-06
95699     2014-05
433994    2017-06
377818    2017-06
106413    2014-12
Name: first_order_month, dtype: object